In [1]:
import pandas as pd 
import numpy as np

# 1 - Create a dataframe with the names of your colleagues, their age(or an estimate),and their title

In [8]:
df = pd.DataFrame(
    {
        'Name':['emmanuel','mathias','nicolò','domenico'],
        'Age':[23,24,23,23],
        'title':['Ingegnere dei materiali e nanotecnologie','Sviluppatore Software','Psicologo','Ingegnere informatico']
    }
)

In [9]:
df

       Name  Age                                     title
0  emmanuel   23  Ingegnere dei materiali e nanotecnologie
1   mathias   24                     Sviluppatore Software
2    nicolò   23                                 Psicologo
3  domenico   23                     Ingegnere informatico

# 2 - capitalize the values in the name column

In [16]:
df["Name"]=df["Name"].str.capitalize()

In [17]:
df

       Name  Age                                     title
0  Emmanuel   23  Ingegnere dei materiali e nanotecnologie
1   Mathias   24                     Sviluppatore Software
2    Nicolò   23                                 Psicologo
3  Domenico   23                     Ingegnere informatico

# 3-Sum up the values of the age column

In [18]:
df['Age'].sum()

93